{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = 'neo4j://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = '1234'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri, auth=(user, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_query(func):    \n",
    "    with driver.session() as session:         \n",
    "        session.read_transaction(func)   "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 기본 폼"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "기분의종류에는 지침, 슬픔, 화남, 기쁨 이있습니다.\n"
     ]
    }
   ],
   "source": [
    "lst = []\n",
    "def get_feelings(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:감정{기분:'기분'}) - [r:종류] -> (b)\n",
    "               RETURN b.기분 AS 기분의종류\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        lst.append(record['기분의종류']) \n",
    "\n",
    "    print('기분의종류에는', ', '.join(lst), '이있습니다.')\n",
    "    \n",
    "run_query(get_feelings)      "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## '슬퍼'단어가 어떤 감정인지 분류 "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "f=[]\n",
    "def get_feeling(tx):\n",
    "    feeling='슬퍼'\n",
    "    lst = []\n",
    "    lst1 = []\n",
    "    lst2 = []\n",
    "    lst3 = []\n",
    "    query = \"\"\"\n",
    "               MATCH (a:기쁨단어)\n",
    "               RETURN a.기쁨 AS 기쁨단어\n",
    "            \"\"\"\n",
    "    query1 = \"\"\"\n",
    "               MATCH (c:화남단어)\n",
    "               RETURN c.화남 AS 화남단어\n",
    "            \"\"\"\n",
    "    query2 = \"\"\"\n",
    "               MATCH (d:지침단어)\n",
    "               RETURN d.지침 AS 지침단어\n",
    "            \"\"\"\n",
    "    query3 = \"\"\"\n",
    "               MATCH (b:슬픔단어)\n",
    "               RETURN b.슬픔 AS 슬픔단어\n",
    "            \"\"\"\n",
    "    result = tx.run(query)\n",
    "    result1 = tx.run(query1)\n",
    "    result2 = tx.run(query2)\n",
    "    result3 = tx.run(query3)\n",
    "    for record in result:\n",
    "        lst.append(record['기쁨단어']) \n",
    "    for record in result1:\n",
    "        lst1.append(record['화남단어'])\n",
    "    for record in result2:\n",
    "        lst2.append(record['지침단어'])\n",
    "    for record in result3:\n",
    "        lst3.append(record['슬픔단어'])\n",
    "    if feeling in lst:\n",
    "        feel='기쁨'\n",
    "#         print('기쁨')\n",
    "    elif feeling in lst1:\n",
    "        feel='화남'\n",
    "#         print('화남')\n",
    "    elif feeling in lst2:\n",
    "        feel='지침'\n",
    "#         print('지침')\n",
    "    elif feeling in lst3:\n",
    "        feel='슬픔'\n",
    "#         print('슬픔')\n",
    "    else:\n",
    "        feel='None'\n",
    "#         print('None')\n",
    "#     print(feel)\n",
    "    f.append(feel)\n",
    "    \n",
    "run_query(get_feeling)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['슬픔']"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 감정과 '땡긴다'의 관계를가진 맛종류 출력"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "angry=[]\n",
    "def get_angry_taste(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:감정{기분:'화남'}) - [r:땡긴다] -> (b)\n",
    "               RETURN b.종류 AS 맛종류\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        angry.append(record['맛종류']) \n",
    "\n",
    "# run_query(get_angry_taste)      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "happy=[]\n",
    "def get_happy_taste(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:감정{기분:'기쁨'}) - [r:땡긴다] -> (b)\n",
    "               RETURN b.종류 AS 맛종류\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        happy.append(record['맛종류']) \n",
    "\n",
    "# run_query(get_happy_taste)      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "sad=[]\n",
    "def get_sad_taste(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:감정{기분:'슬픔'}) - [r:땡긴다] -> (b)\n",
    "               RETURN b.종류 AS 맛종류\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        sad.append(record['맛종류']) \n",
    "\n",
    "# run_query(get_sad_taste)      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "tired=[]\n",
    "def get_tired_taste(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:감정{기분:'지침'}) - [r:땡긴다] -> (b)\n",
    "               RETURN b.종류 AS 맛종류\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        tired.append(record['맛종류']) \n",
    "# run_query(get_tired_taste)      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['매운맛', '단맛', '느끼한맛', '짠맛']"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if f[0]==\"화남\":\n",
    "    run_query(get_angry_taste)\n",
    "    emo=angry\n",
    "elif f[0]==\"기쁨\":\n",
    "    run_query(get_happy_taste)  \n",
    "    emo=happy\n",
    "elif f[0]==\"슬픔\":\n",
    "    run_query(get_sad_taste)  \n",
    "    emo=sad\n",
    "elif f[0]==\"지침\":\n",
    "    run_query(get_tired_taste)  \n",
    "    emo=tired\n",
    "    \n",
    "emo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 맛에대한 메뉴ID들 출력"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "짠맛=[]\n",
    "def get_짠맛menuID(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:짠맛)\n",
    "               RETURN a.메뉴 AS 짠맛\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        짠맛.append(record['짠맛']) \n",
    "\n",
    "run_query(get_짠맛menuID)      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 짠맛"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "매운맛=[]\n",
    "def get_매운맛menuID(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:매운맛)\n",
    "               RETURN a.메뉴 AS 매운맛\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        매운맛.append(record['매운맛']) \n",
    "        \n",
    "run_query(get_매운맛menuID)   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 매운맛"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "느끼한맛=[]\n",
    "def get_느끼한맛menuID(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:느끼한맛)\n",
    "               RETURN a.메뉴 AS 느끼한맛\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        느끼한맛.append(record['느끼한맛']) \n",
    "\n",
    "run_query(get_느끼한맛menuID)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 느끼한맛"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "단맛=[]\n",
    "def get_단맛menuID(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:단맛)\n",
    "               RETURN a.메뉴 AS 단맛\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        단맛.append(record['단맛']) \n",
    "\n",
    "run_query(get_단맛menuID)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "신맛=[]\n",
    "def get_신맛menuID(tx):\n",
    "    query = \"\"\"\n",
    "               MATCH (a:신맛)\n",
    "               RETURN a.메뉴 AS 신맛\n",
    "            \"\"\"\n",
    "    result = tx.run(query)    \n",
    "    \n",
    "    for record in result:\n",
    "        신맛.append(record['신맛']) \n",
    "\n",
    "run_query(get_신맛menuID)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "taste_menu=[]\n",
    "for j in emo:\n",
    "    if j=='짠맛':\n",
    "        run_query(get_짠맛menuID)\n",
    "        taste_menu.append(짠맛)\n",
    "    elif j=='느끼한맛':\n",
    "        run_query(get_느끼한맛menuID) \n",
    "        taste_menu.append(느끼한맛)\n",
    "    elif j=='매운맛':\n",
    "        run_query(get_매운맛menuID)  \n",
    "        taste_menu.append(매운맛)\n",
    "    elif j=='단맛':\n",
    "        run_query(get_단맛menuID)  \n",
    "        taste_menu.append(단맛)\n",
    "    elif j=='신맛':\n",
    "        run_query(get_신맛menuID)  \n",
    "        taste_menu.append(신맛)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(taste_menu)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "399"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#2차원배열을 1차원으로\n",
    "taste_menu = sum(taste_menu, [])\n",
    "# 집합으로 변환\n",
    "taste_menu = set(taste_menu)\n",
    "\n",
    "# 리스트로 변환\n",
    "taste_menu = list(taste_menu)\n",
    "len(taste_menu)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['J00337',\n",
       " 'J00253',\n",
       " 'J00052',\n",
       " 'J00281',\n",
       " 'J00018',\n",
       " 'J00082',\n",
       " 'J00156',\n",
       " 'J00283',\n",
       " 'J00164',\n",
       " 'J00384',\n",
       " 'J00008',\n",
       " 'J00311',\n",
       " 'J00054',\n",
       " 'J00148',\n",
       " 'J00214',\n",
       " 'J00364',\n",
       " 'J00240',\n",
       " 'J00040',\n",
       " 'J00109',\n",
       " 'J00292',\n",
       " 'J00260',\n",
       " 'J00309',\n",
       " 'J00234',\n",
       " 'J00213',\n",
       " 'J00353',\n",
       " 'J00379',\n",
       " 'J00099',\n",
       " 'J00149',\n",
       " 'J00004',\n",
       " 'J00088',\n",
       " 'J00294',\n",
       " 'J00113',\n",
       " 'J00001',\n",
       " 'J00312',\n",
       " 'J00066',\n",
       " 'J00190',\n",
       " 'J00014',\n",
       " 'J00387',\n",
       " 'J00057',\n",
       " 'J00318',\n",
       " 'J00207',\n",
       " 'J00186',\n",
       " 'J00021',\n",
       " 'J00117',\n",
       " 'J00332',\n",
       " 'J00229',\n",
       " 'J00098',\n",
       " 'J00232',\n",
       " 'J00022',\n",
       " 'J00247',\n",
       " 'J00048',\n",
       " 'J00079',\n",
       " 'J00282',\n",
       " 'J00299',\n",
       " 'J00231',\n",
       " 'J00155',\n",
       " 'J00023',\n",
       " 'J00024',\n",
       " 'J00028',\n",
       " 'J00030',\n",
       " 'J00342',\n",
       " 'J00355',\n",
       " 'J00265',\n",
       " 'J00144',\n",
       " 'J00339',\n",
       " 'J00193',\n",
       " 'J00368',\n",
       " 'J00167',\n",
       " 'J00393',\n",
       " 'J00139',\n",
       " 'J00108',\n",
       " 'J00107',\n",
       " 'J00277',\n",
       " 'J00223',\n",
       " 'J00204',\n",
       " 'J00002',\n",
       " 'J00176',\n",
       " 'J00074',\n",
       " 'J00200',\n",
       " 'J00304',\n",
       " 'J00301',\n",
       " 'J00063',\n",
       " 'J00169',\n",
       " 'J00085',\n",
       " 'J00036',\n",
       " 'J00157',\n",
       " 'J00285',\n",
       " 'J00050',\n",
       " 'J00068',\n",
       " 'J00039',\n",
       " 'J00206',\n",
       " 'J00391',\n",
       " 'J00300',\n",
       " 'J00320',\n",
       " 'J00313',\n",
       " 'J00258',\n",
       " 'J00385',\n",
       " 'J00123',\n",
       " 'J00114',\n",
       " 'J00120',\n",
       " 'J00025',\n",
       " 'J00227',\n",
       " 'J00026',\n",
       " 'J00183',\n",
       " 'J00273',\n",
       " 'J00035',\n",
       " 'J00236',\n",
       " 'J00104',\n",
       " 'J00322',\n",
       " 'J00134',\n",
       " 'J00327',\n",
       " 'J00159',\n",
       " 'J00141',\n",
       " 'J00375',\n",
       " 'J00056',\n",
       " 'J00340',\n",
       " 'J00101',\n",
       " 'J00032',\n",
       " 'J00242',\n",
       " 'J00212',\n",
       " 'J00166',\n",
       " 'J00351',\n",
       " 'J00182',\n",
       " 'J00350',\n",
       " 'J00145',\n",
       " 'J00007',\n",
       " 'J00334',\n",
       " 'J00140',\n",
       " 'J00382',\n",
       " 'J00106',\n",
       " 'J00075',\n",
       " 'J00146',\n",
       " 'J00150',\n",
       " 'J00333',\n",
       " 'J00220',\n",
       " 'J00266',\n",
       " 'J00400',\n",
       " 'J00286',\n",
       " 'J00225',\n",
       " 'J00338',\n",
       " 'J00126',\n",
       " 'J00041',\n",
       " 'J00202',\n",
       " 'J00346',\n",
       " 'J00047',\n",
       " 'J00274',\n",
       " 'J00138',\n",
       " 'J00089',\n",
       " 'J00359',\n",
       " 'J00259',\n",
       " 'J00143',\n",
       " 'J00058',\n",
       " 'J00310',\n",
       " 'J00363',\n",
       " 'J00239',\n",
       " 'J00154',\n",
       " 'J00077',\n",
       " 'J00168',\n",
       " 'J00122',\n",
       " 'J00187',\n",
       " 'J00152',\n",
       " 'J00051',\n",
       " 'J00307',\n",
       " 'J00389',\n",
       " 'J00302',\n",
       " 'J00390',\n",
       " 'J00069',\n",
       " 'J00367',\n",
       " 'J00361',\n",
       " 'J00055',\n",
       " 'J00290',\n",
       " 'J00065',\n",
       " 'J00293',\n",
       " 'J00291',\n",
       " 'J00037',\n",
       " 'J00244',\n",
       " 'J00053',\n",
       " 'J00067',\n",
       " 'J00250',\n",
       " 'J00376',\n",
       " 'J00046',\n",
       " 'J00160',\n",
       " 'J00218',\n",
       " 'J00358',\n",
       " 'J00171',\n",
       " 'J00080',\n",
       " 'J00185',\n",
       " 'J00172',\n",
       " 'J00103',\n",
       " 'J00135',\n",
       " 'J00263',\n",
       " 'J00251',\n",
       " 'J00086',\n",
       " 'J00208',\n",
       " 'J00319',\n",
       " 'J00356',\n",
       " 'J00091',\n",
       " 'J00042',\n",
       " 'J00325',\n",
       " 'J00221',\n",
       " 'J00396',\n",
       " 'J00081',\n",
       " 'J00383',\n",
       " 'J00016',\n",
       " 'J00216',\n",
       " 'J00161',\n",
       " 'J00372',\n",
       " 'J00163',\n",
       " 'J00380',\n",
       " 'J00096',\n",
       " 'J00177',\n",
       " 'J00296',\n",
       " 'J00078',\n",
       " 'J00087',\n",
       " 'J00303',\n",
       " 'J00288',\n",
       " 'J00270',\n",
       " 'J00348',\n",
       " 'J00245',\n",
       " 'J00072',\n",
       " 'J00153',\n",
       " 'J00027',\n",
       " 'J00381',\n",
       " 'J00386',\n",
       " 'J00119',\n",
       " 'J00377',\n",
       " 'J00059',\n",
       " 'J00362',\n",
       " 'J00233',\n",
       " 'J00049',\n",
       " 'J00349',\n",
       " 'J00129',\n",
       " 'J00394',\n",
       " 'J00278',\n",
       " 'J00158',\n",
       " 'J00084',\n",
       " 'J00287',\n",
       " 'J00019',\n",
       " 'J00357',\n",
       " 'J00243',\n",
       " 'J00315',\n",
       " 'J00127',\n",
       " 'J00306',\n",
       " 'J00341',\n",
       " 'J00184',\n",
       " 'J00033',\n",
       " 'J00179',\n",
       " 'J00276',\n",
       " 'J00083',\n",
       " 'J00197',\n",
       " 'J00062',\n",
       " 'J00329',\n",
       " 'J00073',\n",
       " 'J00165',\n",
       " 'J00241',\n",
       " 'J00373',\n",
       " 'J00017',\n",
       " 'J00043',\n",
       " 'J00142',\n",
       " 'J00170',\n",
       " 'J00174',\n",
       " 'J00324',\n",
       " 'J00272',\n",
       " 'J00289',\n",
       " 'J00060',\n",
       " 'J00347',\n",
       " 'J00012',\n",
       " 'J00254',\n",
       " 'J00133',\n",
       " 'J00297',\n",
       " 'J00392',\n",
       " 'J00321',\n",
       " 'J00284',\n",
       " 'J00271',\n",
       " 'J00328',\n",
       " 'J00255',\n",
       " 'J00205',\n",
       " 'J00196',\n",
       " 'J00262',\n",
       " 'J00261',\n",
       " 'J00374',\n",
       " 'J00323',\n",
       " 'J00034',\n",
       " 'J00388',\n",
       " 'J00124',\n",
       " 'J00210',\n",
       " 'J00175',\n",
       " 'J00257',\n",
       " 'J00013',\n",
       " 'J00178',\n",
       " 'J00020',\n",
       " 'J00344',\n",
       " 'J00173',\n",
       " 'J00316',\n",
       " 'J00399',\n",
       " 'J00314',\n",
       " 'J00222',\n",
       " 'J00330',\n",
       " 'J00201',\n",
       " 'J00029',\n",
       " 'J00097',\n",
       " 'J00111',\n",
       " 'J00275',\n",
       " 'J00061',\n",
       " 'J00269',\n",
       " 'J00076',\n",
       " 'J00006',\n",
       " 'J00371',\n",
       " 'J00336',\n",
       " 'J00110',\n",
       " 'J00195',\n",
       " 'J00132',\n",
       " 'J00071',\n",
       " 'J00398',\n",
       " 'J00003',\n",
       " 'J00064',\n",
       " 'J00151',\n",
       " 'J00230',\n",
       " 'J00370',\n",
       " 'J00125',\n",
       " 'J00191',\n",
       " 'J00038',\n",
       " 'J00279',\n",
       " 'J00189',\n",
       " 'J00248',\n",
       " 'J00112',\n",
       " 'J00267',\n",
       " 'J00256',\n",
       " 'J00005',\n",
       " 'J00115',\n",
       " 'J00360',\n",
       " 'J00136',\n",
       " 'J00209',\n",
       " 'J00246',\n",
       " 'J00194',\n",
       " 'J00092',\n",
       " 'J00228',\n",
       " 'J00215',\n",
       " 'J00352',\n",
       " 'J00219',\n",
       " 'J00235',\n",
       " 'J00105',\n",
       " 'J00326',\n",
       " 'J00192',\n",
       " 'J00252',\n",
       " 'J00044',\n",
       " 'J00199',\n",
       " 'J00226',\n",
       " 'J00131',\n",
       " 'J00238',\n",
       " 'J00224',\n",
       " 'J00093',\n",
       " 'J00130',\n",
       " 'J00317',\n",
       " 'J00031',\n",
       " 'J00264',\n",
       " 'J00070',\n",
       " 'J00305',\n",
       " 'J00102',\n",
       " 'J00211',\n",
       " 'J00335',\n",
       " 'J00369',\n",
       " 'J00137',\n",
       " 'J00045',\n",
       " 'J00354',\n",
       " 'J00268',\n",
       " 'J00237',\n",
       " 'J00217',\n",
       " 'J00147',\n",
       " 'J00128',\n",
       " 'J00118',\n",
       " 'J00162',\n",
       " 'J00188',\n",
       " 'J00116',\n",
       " 'J00295',\n",
       " 'J00100',\n",
       " 'J00090',\n",
       " 'J00331',\n",
       " 'J00345',\n",
       " 'J00094',\n",
       " 'J00378',\n",
       " 'J00249',\n",
       " 'J00203',\n",
       " 'J00011',\n",
       " 'J00395',\n",
       " 'J00010',\n",
       " 'J00308',\n",
       " 'J00298',\n",
       " 'J00121',\n",
       " 'J00343',\n",
       " 'J00015']"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "taste_menu"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
